import React from 'react';

export default function AboutMe() {
  return (
    <main>
      <h1>개발자가 되기로 결심한 이유</h1>
      <p>
        저는 세상 모든 당연한 것들에 대해 왜?라는 질문을 던집니다. 그러나 어린 시절 수학 수업에서 0.10을 왜 0.1로 표기해야 하는지 선생님께 질문하다 혼나고
        반성문을 쓴 적이 있습니다. 수업 중에 손을 들면 쟤 또 질문한다 하며 수근거리던 목소리도 기억합니다. 늘 질문으로 탐구하며 성장하고자 했지만, 주어진 내용을
        그대로 암기하고 질문하지 않아야 한다는 문화가 자리 잡은 한국의 교육시스템에서 늘 소외 당했습니다. 그래서 저는 질문하며 성장하고 싶다라는 열망 하나로
        중학교 졸업 직후, 영어 한마디 못하는 상태로 혼자 미국으로 떠났습니다.** 처음에는 수업 내용도 이해하지 못했습니다. 하지만, 몇 시간이고 남아서 질문을
        받아주시던 선생님과 수업 노트를 공유해 주는 친구들의 도움을 받아, 매일 밤 지새우며 공부했습니다. 그 결과, 4년 뒤 **원어민 수준의 영어 실력을 갖추고,
        학급 상위 1%에 해당하는 성적으로 졸업**할 수 있었습니다. 이러한 경험이 **성장하기 위해 끊임없이 질문하고, 지식을 공유하며 도움을 주는 제 삶의 가치관을
        만들었습니다.** 대학교 3학년, 당연하게 받아들여지는 세상의 문제들을 풀기 위해 **컴퓨터 공학 전공 친구들과 함께 창업**을 했습니다. **발로 뛰며 고객을
        만나고 UX를 독학**하며 디자인을 완성했지만, 업무 분배와 일정 관리, 개발자와의 소통 등에서 **“개발을 못하는 리더”로서의 한계**를 경험했고, 배포도 되기
        전에 팀이 무너지는 경험을 했습니다. 이를 극복하기 위해 코드스테이츠 부트캠프에 들어가 프로그래밍 능력을 키우는데 매진했습니다. 필요에 의해 시작한 개발
        공부이지만, 이제는 개발자로서의 커리어를 진심으로 희망합니다. **서로의 코드를 공유하고 자신의 생각을 자유롭게 나누며, 하나의 기술을 도입할 때도
        “왜?”라는 의문을 끊임없이 던지는 개발자 문화가 제 가치관과 일치합니다.** 자유로운 의견 공유 문화 속에서, **당연하게 여겼던 것들에 의문을 품고 더 많은
        사용자가 편리하게 서비스를 이용할 수 있도록 만드는 것**에 진정한 행복을 느낍니다.
      </p>
    </main>
  );
}
